Revit 2027 API
UpdaterRegistry.UnregisterUpdater Method
Overload List
Name | Description
UnregisterUpdater(UpdaterId) |  Removes the updater associated with the input id from the UpdaterRegistry. Also removes all triggers associated with the Updater.
UnregisterUpdater(UpdaterId, Document) |  Unregisters an updater for the given document.
Top
See Also
Reference
UpdaterRegistry Class
Autodesk.Revit.DB Namespace